// data/suraGroups.js
const surahGroups = [
  {
    label: "من الجزء 1 إلى 10",
    suras: [
      "الفاتحة", "البقرة", "آل عمران", "النساء", "المائدة",
      "الأنعام", "الأعراف", "الأنفال", "التوبة"
    ],
  },
  {
    label: "من الجزء 11 إلى 20",
    suras: [
      "يونس", "هود", "يوسف", "الرعد", "إبراهيم", "الحجر", "النحل",
      "الإسراء", "الكهف", "مريم", "طه", "الأنبياء", "الحج", "المؤمنون",
      "النور", "الفرقان", "الشعراء", "النمل", "القصص"
    ],
  },
  {
    label: "من الجزء 21 إلى 30",
    suras: [
      "العنكبوت", "الروم", "لقمان", "السجدة", "الأحزاب", "سبأ", "فاطر",
      "يس", "الصافات", "ص", "الزمر", "غافر", "فصلت", "الشورى", "الزخرف",
      "الدخان", "الجاثية", "الأحقاف", "محمد", "الفتح", "الحجرات", "ق",
      "الذاريات", "الطور", "النجم", "القمر", "الرحمن", "الواقعة", "الحديد",
      "المجادلة", "الحشر", "الممتحنة", "الصف", "الجمعة", "المنافقون",
      "التغابن", "الطلاق", "التحريم", "الملك", "القلم", "الحاقة", "المعارج",
      "نوح", "الجن", "المزمل", "المدثر", "القيامة", "الإنسان", "المرسلات",
      "النبأ", "النازعات", "عبس", "التكوير", "الانفطار", "المطففين",
      "الانشقاق", "البروج", "الطارق", "الأعلى", "الغاشية", "الفجر",
      "البلد", "الشمس", "الليل", "الضحى", "الشرح", "التين", "العلق",
      "القدر", "البينة", "الزلزلة", "العاديات", "القارعة", "التكاثر",
      "العصر", "الهمزة", "الفيل", "قريش", "الماعون", "الكوثر", "الكافرون",
      "النصر", "المسد", "الإخلاص", "الفلق", "الناس",
    ],
  },
];

export default suraGroups;
